#Task_1
a = float(input("Введите 1-ое число:"))
b = float(input("Введите 2-ое число:"))
print(f"Сумма чисел {a} и {b} = {a + b}" 
f"\nРазность чисел {a} и {b} = {a - b}"
f"\nПроизведение чисел {a} и {b} = {a*b}"
f"\nЧастное чисел {a} и {b} = {a/b}" 
f"\nЧисло {a} в степени {b} = {a**b}"
f"\nОстаток частного чисел {a} и {b} = {a % b}"
f"\nЦелое частного чисел {a} и {b} = {a // b}")


#Task_2
name = input("Введите своё имя: ")
print(f"Здравствуйте, {name}")

#Task_3
s = str(input("Введите строку: "))
print(s[:-3:-1])

#Task_4
import math

r = float(input("Введите радиус: "))
print(f"Площадь круга с радиусом {r}: {math.pi * (r**2)}")